app/views/credits/_form.html.slim

    = f.label :member_id
    = f.select :member_id, options_for_select(Member.all.collect {|u| [u.email, u.id]} )
---
SELECT `members`.* FROM `members`