app/views/credits/new.html.slim

SELECT `credits`.* FROM `credits`
---
      tbody
        - Credit.all.try(:reverse).each do |credit|