app/controllers/credits_controller.rb

INSERT INTO `credits` (`amount`, `created_at`, `currency`, `member_id`, `updated_at`) VALUES (23, '2014-07-23 17:39:24', 'btc', 1, '2014-07-23 17:39:24')
---
  def create
  	current_user.credits.create(params[:credit].permit!)

SELECT `credits`.* FROM `credits` WHERE `credits`.`id` = 1 LIMIT 1
DELETE FROM `credits` WHERE `credits`.`id` = 1
---
  def delete
  	@credit=Credit.find(params[:id])
  	@credit.destroy