app/models/global.rb

  def ticker
    ticker          = Rails.cache.read("peatio:#{currency}:ticker") || default_ticker
    best_buy_price  = bids.first && bids.first[0] || ZERO
    best_sell_price = asks.first && asks.first[0] || ZERO
    volume          = Trade.with_currency(currency).h24.sum(:volume) || ZERO
---
SELECT SUM(`trades`.`volume`) AS sum_id FROM `trades`  WHERE `trades`.`currency` = 3 AND (created_at > '2014-07-15 19:45:27')