app/controllers/private/markets_controller.rb

    def show
     @bid = params[:bid]
     @ask = params[:ask]

      # @bid = "btc"
      # @ask = "drk"
      @ask_name = I18n.t("currency.name.#{@ask}")
      @bid_name = I18n.t("currency.name.#{@bid}")

      @market = current_market

      @bids   = Global[@market].bids
      @asks   = Global[@market].asks
      @trades = Global[@market].trades
      @price  = Global[@market].price
      @ticker = Global[@market].ticker

      # default to limit order
      @order_bid = OrderBid.new ord_type: 'limit'
      @order_ask = OrderAsk.new ord_type: 'limit'

      @member = current_user

      @member.orders.with_currency(@market).tap do |query|
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`type` IN ('OrderAsk') AND `orders`.`id` = 4 LIMIT 1 FOR UPDATE